src/cf/src/InformationRegisters/ЗатраченноеВремяПоЗадачам/ЗатраченноеВремяПоЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗатраченноеВремяПоЗадачам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЗатраченноеВремя</name>
    <type>
      <types>DefinedType.ТрудоемкостьЧасовНеотрицательная</types>
    </type>
  </resources>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторФиксацииВремени</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтразитьРаботуПоЗадаче</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаПоЗадаче</name>
    <type>
      <types>DocumentRef.РаботыПоЗадаче</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <comment>АПК:1208 Считаем корректным имя в Купорос</comment>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРаботы</name>
    <type>
      <types>CatalogRef.ВидыРабот</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Documents/РаботыПоЗадаче/РаботыПоЗадаче.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РаботыПоЗадаче</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСОрганизациями</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Задача</name>
    <comment>АПК:1208 Считаем корректным имя в Купорос</comment>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяТрудоемкость</name>
    <type>
      <types>DefinedType.ТрудоемкостьЧасовНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>РучноеДобавление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

src/cf/src/InformationRegisters/ЗатраченноеВремяПоЗадачам/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Запись.Исполнитель.Пустая() Тогда
		Запись.Исполнитель = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Управление доступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// зафиксировать работу по задаче (ручное добавление)
	Если ТекущийОбъект.ОтразитьРаботуПоЗадаче Тогда
		
		ВестиУчетАктовВыполненныхРабот = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект.Задача, "Проект.ВестиУчетАктовВыполненныхРабот");
		
		Если ВестиУчетАктовВыполненныхРабот Тогда
		
			ДанныеДляФиксацииРабот = Новый Структура;
			ДанныеДляФиксацииРабот.Вставить("Дата", ТекущийОбъект.Период);
			ДанныеДляФиксацииРабот.Вставить("Задача", ТекущийОбъект.Задача);
			ДанныеДляФиксацииРабот.Вставить("Исполнитель", ТекущийОбъект.Исполнитель);
			ДанныеДляФиксацииРабот.Вставить("ФактическаяТрудоемкость", ТекущийОбъект.ЗатраченноеВремя);
			ДанныеДляФиксацииРабот.Вставить("РучноеДобавление", Истина);
			ДанныеДляФиксацииРабот.Вставить("РаботаПоЗадаче", ТекущийОбъект.РаботаПоЗадаче);
			
			Документы.РаботыПоЗадаче.ЗафиксироватьРаботуПоЗадаче(ДанныеДляФиксацииРабот);
			
			ТекущийОбъект.РаботаПоЗадаче = ДанныеДляФиксацииРабот.РаботаПоЗадаче;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Изменение_ФактическиеТрудозатратыЗадачи",,Запись.Задача);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.Период) Тогда
		Запись.Период = КонецДня(Запись.Период);
	КонецЕсли;	
	
КонецПроцедуры
